In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [24]:
df = pd.read_csv('Query 14.csv')

In [25]:
df.head()

   actor_id      actor_name  total_amount
0       107  Gina Degeneres       3129.17
1       181  Matthew Carrey       2543.78
2       198     Mary Keitel       2426.92
3        81  Scarlett Damon       2403.81
4       102     Walter Torn       2403.18

In [26]:

# Agrupar por actor_id y actor_name, y calcular el total_amount
actores_total_amount = df.groupby(['actor_id', 'actor_name']).agg({'total_amount': 'sum'}).reset_index()

# Ordenar el DataFrame por el total_amount en orden descendente
actores_sorted = actores_total_amount.sort_values('total_amount', ascending=False)

# Tomar los primeros 10 registros (los actores con el total_amount m√°s alto)
top_10_actores = actores_sorted.head(10)

# Mostrar la lista de los 10 actores con el mayor total_amount
print(top_10_actores)

     actor_id          actor_name  total_amount
106       107      Gina Degeneres       3129.17
180       181      Matthew Carrey       2543.78
197       198         Mary Keitel       2426.92
80         81      Scarlett Damon       2403.81
101       102         Walter Torn       2403.18
59         60         Henry Berry       2392.36
57         58    Christian Akroyd       2378.97
143       144  Angela Witherspoon       2357.11
110       111   Cameron Zellweger       2322.94
27         28       Woody Hoffman       2315.92